{"author details": [], "urls": ["https://www.goodreads.com/book/show/27362503-it-ends-with-us?from_search=true&from_srp=true&qid=u8BiTgw23F&rank=1", "https://www.goodreads.com/book/show/17788401-ugly-love?from_search=true&from_srp=true&qid=u8BiTgw23F&rank=2", "https://www.goodreads.com/book/show/58341222-reminders-of-him?from_search=true&from_srp=true&qid=u8BiTgw23F&rank=3", "https://www.goodreads.com/book/show/25111004-november-9?from_search=true&from_srp=true&qid=u8BiTgw23F&rank=4", "https://www.goodreads.com/book/show/15717943-hopeless?from_search=true&from_srp=true&qid=u8BiTgw23F&rank=5", "https://www.goodreads.com/book/show/59344312-verity?from_search=true&from_srp=true&qid=u8BiTgw23F&rank=6", "https://www.goodreads.com/book/show/44582454-regretting-you?from_search=true&from_srp=true&qid=u8BiTgw23F&rank=7", "https://www.goodreads.com/book/show/21952567-maybe-someday?from_search=true&from_srp=true&qid=u8BiTgw23F&rank=8", "https://www.goodreads.com/book/show/52089753-layla?from_search=true&from_srp=true&qid=u8BiTgw23F&rank=9", "https://www.goodreads.com/book/show/24445517-maybe-someday?from_search=true&from_srp=true&qid=u8BiTgw23F&rank=10", "https://www.goodreads.com/book/show/51007311-heart-bones?from_search=true&from_srp=true&qid=u8BiTgw23F&rank=11", "https://www.goodreads.com/book/show/38926487-all-your-perfects?from_search=true&from_srp=true&qid=u8BiTgw23F&rank=12", "https://www.goodreads.com/book/show/24378015-never-never?from_search=true&from_srp=true&qid=u8BiTgw23F&rank=13", "https://www.goodreads.com/book/show/17340050-losing-hope?from_search=true&from_srp=true&qid=u8BiTgw23F&rank=14", "https://www.goodreads.com/book/show/30333938-slammed?from_search=true&from_srp=true&qid=u8BiTgw23F&rank=15", "https://www.goodreads.com/book/show/34324605-confess?from_search=true&from_srp=true&qid=u8BiTgw23F&rank=16", "https://www.goodreads.com/book/show/58826526-colleen-hoover-3-books-collection-set?from_search=true&from_srp=true&qid=u8BiTgw23F&rank=17", "https://www.goodreads.com/book/show/60393672-it-starts-with-us?from_search=true&from_srp=true&qid=u8BiTgw23F&rank=18", "https://www.goodreads.com/book/show/33280872-without-merit?from_search=true&from_srp=true&qid=u8BiTgw23F&rank=19", "https://www.goodreads.com/book/show/24838049-the-abbi-glines-colleen-hoover-and-jamie-mcguire-official-fan-book?from_search=true&from_srp=true&qid=u8BiTgw23F&rank=20"], "unique ID": ["27362503", "17788401", "58341222", "25111004", "15717943", "59344312", "44582454", "21952567", "52089753", "24445517", "51007311", "38926487", "24378015", "17340050", "30333938", "34324605", "58826526", "60393672", "33280872", "24838049"], "book title": ["It Ends with Us", "Ugly Love", "Reminders of Him", "November 9", "Hopeless", "Verity", "Regretting You", "Maybe Someday: by Colleen Hoover | Summary & Analysis", "Layla", "Maybe Someday", "Heart Bones", "All Your Perfects", "Never Never", "Losing Hope", "Slammed", "Confess", "Colleen Hoover 3 Books Collection Set (November 9, Ugly Love, It Ends with Us)", "It Starts with Us", "Without Merit", "The Abbi Glines, Colleen Hoover, and Jamie McGuire Official Fan Book"], "author name": ["by Colleen Hoover (Goodreads Author)", "by Colleen Hoover (Goodreads Author)", "by Colleen Hoover (Goodreads Author)", "by Colleen Hoover (Goodreads Author)", "by Colleen Hoover (Goodreads Author)", "by Colleen Hoover (Goodreads Author)", "by Colleen Hoover (Goodreads Author)", "by Book*Sense", "by Colleen Hoover (Goodreads Author)", "by Colleen Hoover (Goodreads Author)", "by Colleen Hoover (Goodreads Author)", "by Colleen Hoover (Goodreads Author)", "by Colleen Hoover (Goodreads Author), Tarryn Fisher (Goodreads Author)", "by Colleen Hoover (Goodreads Author)", "by Colleen Hoover (Goodreads Author)", "by Colleen Hoover (Goodreads Author)", "by Colleen Hoover (Goodreads Author), It Ends with Us By Colleen Hoover (Contributor), Ugly Love By Colleen Hoover (Contributor), November 9 By Colleen Hoover (Contributor)", "by Colleen Hoover (Goodreads Author)", "by Colleen Hoover (Goodreads Author)", "by Abbi Glines (Goodreads Author), Colleen Hoover (Goodreads Author), Jamie McGuire (Goodreads Author)"], "rating": ["4.43", "4.26", "4.57", "4.33", "4.28", "4.43", "4.24", "4.44", "3.80", "4.21", "4.35", "4.30", "4.03", "4.31", "4.23", "4.21", "4.62", "4.82", "3.88", "4.50"], "book description": ["Sometimes it is the one who loves you who hurts you the most.\n\nLily hasn’t always had it easy, but that’s never stopped her from working hard for the life she wants. She’s come a long way from the small town in Maine where she grew up\n— she graduated from college, moved to Boston, and started her own business. So when she feels a spark with a gorgeous neurosurgeon named Ryle Kincaid, everything in Lily’s life suddenly seems almost too good to be true.\n\nRyle is assertive, stubborn, maybe even a little arrogant. He’s also sensitive, brilliant, and has a total soft spot for Lily. And the way he looks in scrubs certainly doesn’t hurt. Lily can’t get him out of her head. But Ryle’s complete aversion to relationships is disturbing. Even as Lily finds herself becoming the exception to his “no dating” rule, she can’t help but wonder what made him that way in the first place.\n\nAs questions about her new relationship overwhelm her, so do thoughts of Atlas Corrigan — her first love and a link to the past she left behind. He was her kindred spirit, her protector. When Atlas suddenly reappears, everything Lily has built with Ryle is threatened. (less)", "When Tate Collins meets airline pilot Miles Archer, she knows it isn’t love at first sight. They wouldn’t even go so far as to consider themselves friends. The only thing Tate and Miles have in common is an undeniable mutual attraction. Once their desires are out in the open, they realize they have the perfect set-up. He doesn’t want love, she doesn’t have time for love, so that just leaves the sex. Their arrangement could be surprisingly seamless, as long as Tate can stick to the only two rules Miles has for her.\n\nNever ask about the past.\nDon’t expect a future.\n\nThey think they can handle it, but realize almost immediately they can’t handle it at all.\n\nHearts get infiltrated.\nPromises get broken.\nRules get shattered.\nLove gets ugly. (less)", "A troubled young mother yearns for a shot at redemption in this heartbreaking yet hopeful story from #1 New York Times bestselling author Colleen Hoover.\n\nAfter serving five years in prison for a tragic mistake, Kenna Rowan returns to the town where it all went wrong, hoping to reunite with her four-year-old daughter. But the bridges Kenna burned are proving impossible to rebuild. Everyone in her daughter’s life is determined to shut Kenna out, no matter how hard she works to prove herself.\n\nThe only person who hasn’t closed the door on her completely is Ledger Ward, a local bar owner and one of the few remaining links to Kenna’s daughter. But if anyone were to discover how Ledger is slowly becoming an important part of Kenna’s life, both would risk losing the trust of everyone important to them.\n\nThe two form a connection despite the pressure surrounding them, but as their romance grows, so does the risk. Kenna must find a way to absolve the mistakes of her past in order to build a future out of hope and healing. (less)", "Fallon meets Ben, an aspiring novelist, the day before her scheduled cross-country move. Their untimely attraction leads them to spend Fallon’s last day in L.A. together, and her eventful life becomes the creative inspiration Ben has always sought for his novel. Over time and amidst the various relationships and tribulations of their own separate lives, they continue to meet on the same date every year. Until one day Fallon becomes unsure if Ben has been telling her the truth or fabricating a perfect reality for the sake of the ultimate plot twist.\n\nCan Ben’s relationship with Fallon—and simultaneously his novel—be considered a love story if it ends in heartbreak?\n\nBeloved #1 New York Times bestselling author Colleen Hoover returns with an unforgettable love story between a writer and his unexpected muse. (less)", "Sometimes discovering the truth can leave you more hopeless than believing the lies…\n\nThat’s what seventeen-year-old Sky realizes after she meets Dean Holder. A guy with a reputation that rivals her own and an uncanny ability to invoke feelings in her she’s never had before. He terrifies her and captivates her all in the span of just one encounter, and something about the way he makes her feel sparks buried memories from a past that she wishes could just stay buried.\n\nSky struggles to keep him at a distance knowing he’s nothing but trouble, but Holder insists on learning everything about her. After finally caving to his unwavering pursuit, Sky soon finds that Holder isn’t at all who he’s been claiming to be. When the secrets he’s been keeping are finally revealed, every single facet of Sky’s life will change forever. (less)", "Lowen Ashleigh is a struggling writer on the brink of financial ruin when she accepts the job offer of a lifetime. Jeremy Crawford, husband of bestselling author Verity Crawford, has hired Lowen to complete the remaining books in a successful series his injured wife is unable to finish.\n\nLowen arrives at the Crawford home, ready to sort through years of Verity's notes and outlines, hoping to find enough material to get her started. What Lowen doesn't expect to uncover in the chaotic office is an unfinished autobiography Verity never intended for anyone to read. Page after page of bone-chilling admissions, including Verity's recollection of what really happened the day her daughter died.\n\nLowen decides to keep the manuscript hidden from Jeremy, knowing its contents would devastate the already grieving father. But as Lowen's feelings for Jeremy begin to intensify, she recognizes all the ways she could benefit if he were to read his wife's words. After all, no matter how devoted Jeremy is to his injured wife, a truth this horrifying would make it impossible for him to continue to love her. (less)", "Morgan Grant and her sixteen-year-old daughter, Clara, would like nothing more than to be nothing alike.\n\nMorgan is determined to prevent her daughter from making the same mistakes she did. By getting pregnant and married way too young, Morgan put her own dreams on hold. Clara doesn’t want to follow in her mother’s footsteps. Her predictable mother doesn’t have a spontaneous bone in her body.\n\nWith warring personalities and conflicting goals, Morgan and Clara find it increasingly difficult to coexist. The only person who can bring peace to the household is Chris—Morgan’s husband, Clara’s father, and the family anchor. But that peace is shattered when Chris is involved in a tragic and questionable accident. The heartbreaking and long-lasting consequences will reach far beyond just Morgan and Clara.\n\nWhile struggling to rebuild everything that crashed around them, Morgan finds comfort in the last person she expects to, and Clara turns to the one boy she’s been forbidden to see. With each passing day, new secrets, resentment, and misunderstandings make mother and daughter fall further apart. So far apart, it might be impossible for them to ever fall back together. (less)", "Maybe Someday: by Colleen Hoover | Summary & Analysis\n\nThis is a Summary & Analysis of the original book. Colleen Hoover exercises her creativity, to depict a contemporary love story, Maybe Someday. The narrative is driven by themes of love, music, love of music and thoroughly modern form of communication.\nShakespeare wrote in Twelfth Night, “If music be the food of love, play on!” Music is most decidedly the food of love in this novel, and they do indeed play on -- right up until the end.\n\nMaybe Someday was written with a definite target audience in mind. This book will appeal to older teens and young adults, particularly females. For others, it will appear somewhat similar to other love stories that they will have read in the past that deals with love triangles, and the pain, joy and complications that surround relationships. What sets it apart, however, is the unique approach that Colleen Hoover takes.\n\nShe has created a novel that incorporates music as an essential theme while, at the same time, her main male protagonist is deaf. It imbues the story with an interesting angle. The innovative touches in Maybe Someday saves the novel from being formulaic, and it is filled with wonderful emotional expressiveness. (less)", "From #1 New York Times bestselling author Colleen Hoover comes a novel that explores life after tragedy and the enduring spirit of love.\n\nWhen Leeds meets Layla, he’s convinced he’ll spend the rest of his life with her—until an unexpected attack leaves Layla fighting for her life. After weeks in the hospital, Layla recovers physically, but the emotional and mental scarring has altered the woman Leeds fell in love with. In order to put their relationship back on track, Leeds whisks Layla away to the bed-and-breakfast where they first met. Once they arrive, Layla’s behavior takes a bizarre turn. And that’s just one of many inexplicable occurrences.\n\nFeeling distant from Layla, Leeds soon finds solace in Willow—another guest of the B&B with whom he forms a connection through their shared concerns. As his curiosity for Willow grows, his decision to help her find answers puts him in direct conflict with Layla’s well-being. Leeds soon realizes he has to make a choice because he can’t help both of them. But if he makes the wrong choice, it could be detrimental for all of them.\n(less)", "Contains exclusive content: songs from Griffin Peterson\n\nSydney is living in an idyllic bubble—she's a dedicated student with a steady job on the side. She lives with her best friend, has a great boyfriend, and the music coming from the balcony opposite hers is fast becoming the soundtrack to her life. But when Sydney finds out her boyfriend is cheating on her, the bubble bursts. The mysterious and attractive man behind the music, Ridge, gives Sydney hope that she can move on and they begin to write songs together. But moving on is harder than she expects, Sydney can only hope….\n\nMaybe someday…\n\nColleen Hoover draws you in to this passionate tale of music, love and betrayal… (less)", "Life and a dismal last name are the only two things Beyah Grim's parents ever gave her. After carving her path all on her own, Beyah is well on her way to bigger and better things, thanks to no one but herself.\n\nWith only two short months separating her from the future she's built and the past she desperately wants to leave behind, an unexpected death leaves Beyah with no place to go during the interim. Forced to reach out to her last resort, Beyah has to spend the remainder of her summer on a peninsula in Texas with a father she barely knows. Beyah's plan is to keep her head down and let the summer slip by seamlessly, but her new neighbor Samson throws a wrench in that plan.\n\nSamson and Beyah have nothing in common on the surface.\n\nShe comes from a life of poverty and neglect; he comes from a family of wealth and privilege. But one thing they do have in common is that they're both drawn to sad things. Which means they're drawn to each other. With an almost immediate connection too intense for them to continue denying, Beyah and Samson agree to stay in the shallow end of a summer fling. What Beyah doesn't realize is that a rip current is coming, and it's about to drag her heart out to sea. (less)", "Colleen Hoover delivers a tour de force novel about a troubled marriage and the one old forgotten promise that might be able to save it.\n\nQuinn and Graham’s perfect love is threatened by their imperfect marriage. The memories, mistakes, and secrets that they have built up over the years are now tearing them apart. The one thing that could save them might also be the very thing that pushes their marriage beyond the point of repair.\n\nAll Your Perfects is a profound novel about a damaged couple whose potential future hinges on promises made in the past. This is a heartbreaking page-turner that asks: Can a resounding love with a perfect beginning survive a lifetime between two imperfect people? (less)", "Charlie Wynwood and Silas Nash have been best friends since they could walk. They've been in love since the age of fourteen. But as of this morning... they are complete strangers. Their first kiss, their first fight, the moment they fell in love... every memory has vanished.\n\nCharlie and Silas must work together to uncover the truth about what happened to them and why. But the more they learn about the couple they used to be, the more they question why they were ever together to begin with.\n\n#1 New York Times bestselling author of Hopeless joins forces with the New York Times bestselling author of Mud Vein. Together, they have created a gripping, romantic tale unlike any other. (less)", "In the follow-up to Colleen Hoover’s #1 New York Times bestseller Hopeless, the charming and irresistible Dean Holder tells the passionate story that has melted thousands of hearts.\n\nIn Hopeless, Sky left no secret unearthed, no feeling unshared, and no memory forgotten, but Holder’s past remained a mystery.\n\nStill haunted by the little girl he let walk away, Holder has spent his entire life searching for her in an attempt to finally rid himself of the crushing guilt he has felt for years. But he could not have anticipated that the moment they reconnect, even greater remorse would overwhelm him…\n\nSometimes in life, if we wish to move forward, we must first dig deep into our past and make amends. In Losing Hope, bestselling author Colleen Hoover reveals what was going on inside Holder’s head during all those hopeless moments—and whether he can gain the peace he desperately needs. (less)", "This is an alternate cover edition for ASIN B008TRUDAS.\n\nFollowing the unexpected death of her father, 18-year-old Layken is forced to be the rock for both her mother and younger brother. Outwardly, she appears resilient and tenacious, but inwardly, she's losing hope.\n\nEnter Will Cooper: The attractive, 21-year-old new neighbor with an intriguing passion for slam poetry and a unique sense of humor. Within days of their introduction, Will and Layken form an intense emotional connection, leaving Layken with a renewed sense of hope.\n\nNot long after an intense, heart-stopping first date, they are slammed to the core when a shocking revelation forces their new relationship to a sudden halt. Daily interactions become impossibly painful as they struggle to find a balance between the feelings that pull them together, and the secret that keeps them apart. (less)", "Auburn Reed is determined to rebuild her shattered life and she has no room for mistakes. But when she walks into a Dallas art studio in search of a job, she doesn’t expect to become deeply attracted to the studio’s enigmatic artist, Owen Gentry.\n\nFor once, Auburn takes a chance and puts her heart in control, only to discover that Owen is hiding a huge secret. The magnitude of his past threatens to destroy everything Auburn loves most, and the only way to get her life back on track is to cut Owen out of it—but can she do it? (less)", "Before It Ends with Us, it started with Atlas. Colleen Hoover tells fan favorite Atlas’ side of the story and shares what comes next in this long-anticipated sequel to the \"glorious and touching\" (USA TODAY) #1 New York Times bestseller It Ends with Us. (less)", "Not every mistake deserves a consequence. Sometimes the only thing it deserves is forgiveness.\n\nThe Voss family is anything but normal. They live in a repurposed church, newly baptized Dollar Voss. The once cancer-stricken mother lives in the basement, the father is married to the mother’s former nurse, the little half-brother isn’t allowed to do or eat anything fun, and the eldest siblings are irritatingly perfect. Then, there’s Merit.\n\nMerit Voss collects trophies she hasn’t earned and secrets her family forces her to keep. While browsing the local antiques shop for her next trophy, she finds Sagan. His wit and unapologetic idealism disarm and spark renewed life into her—until she discovers that he’s completely unavailable. Merit retreats deeper into herself, watching her family from the sidelines when she learns a secret that no trophy in the world can fix.\n\nFed up with the lies, Merit decides to shatter the happy family illusion that she’s never been a part of before leaving them behind for good. When her escape plan fails, Merit is forced to deal with the staggering consequences of telling the truth and losing the one boy she loves. (less)", "Dear Readers,\n\nIt’s hard to believe how much our lives have changed since we first began our publishing careers. Some of you may have discovered us with our New Adult novels, Fallen Too Far, Slammed, and Beautiful Disaster, but our journeys started long before then. For Abbi, it began with her lifelong love of romance novels, an unforgettable Christmas present from her husband, and the inspiration she drew from the Gulf Coast. For Colleen, it began with her childhood imagination, an Avett Brothers lyric, and a desire to write the kinds of books she wanted to read. For Jamie, it began with a three-ring binder that became the first of twenty-one journals, a bestselling young adult series, and the support of her former high school librarian.\n\nFor those who have read and loved our novels, we offer you a glimpse into our lives and careers—both then and now—with photos and videos and a behind-the-scenes look at our 2014 Fall in Love tour. And you’ll also get a sneak peek at what’s coming up from us next.\n\nThank you so much for your support. We wouldn’t be here without you.\n\nAbbi Glines, Colleen Hoover, and Jamie McGuire (less)"], "book_cover_links": ["https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1470427482l/27362503._SY475_.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1632597571l/17788401._SY475_.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1627673942l/58341222._SY475_.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1447138036l/25111004._SY475_.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1353489892l/15717943.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1634158558l/59344312._SY475_.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1559332442l/44582454._SY475_.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1397958627l/21952567.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1593095775l/52089753._SY475_.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1421002815l/24445517.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1580936060l/51007311._SY475_.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1531682842l/38926487.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1428934147l/24378015.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1368348507l/17340050.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1464826448l/30333938.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1488107498l/34324605._SY475_.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1629607132l/58826526._SX318_.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1644605295l/60393672.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1506608833l/33280872._SY475_.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1423486405l/24838049.jpg"], "v4 UUID": ["02e0a5f4-dd01-4541-8e1a-dde51092d4cd", "72c671a2-cfcb-46e1-ba2f-00943a36941e", "ab7c4181-3bcc-4f38-9982-5ad8fcaaacce", "93508fd1-8a39-4dff-9870-29e5395cf65c", "684ab191-4293-4661-83de-6117000410eb", "6f4cc1b0-26e5-4888-8879-85a36d1a5a9b", "405fe1d9-fefd-4773-8c59-fdb15ad29995", "fedff700-0472-4488-a058-3f176e7021e5", "d00b1a2f-b75c-46d4-a824-1c1db0869cd5", "4014ed83-0c0f-4438-830c-fce374c37658", "b186d895-49b5-49e5-93c3-f60b81a04a88", "d30f5cf2-9bd0-4d77-9ebf-b75d0804dffb", "80455d8d-366d-4912-90ed-96a910d8a7fe", "9d225338-15e7-4223-8b46-4fa839054793", "ee938896-72d8-4c31-a13a-f1278f6ad150", "2690fd53-860a-410d-aa16-86e39b798507", "b37331f9-1e35-44b4-a7e0-49165b45dc91", "52de2177-659c-45c1-b18f-7e28d7b4855b", "878144e5-e47a-45f3-bf6c-6c72cf229b7e", "13179247-b24c-48c2-a799-853570616769"]}