{"urls": ["https://www.goodreads.com/book/show/11588.The_Shining?from_search=true&from_srp=true&qid=FsaeR8fKwT&rank=1", "https://www.goodreads.com/book/show/830502.It?from_search=true&from_srp=true&qid=FsaeR8fKwT&rank=2", "https://www.goodreads.com/book/show/149267.The_Stand?from_search=true&from_srp=true&qid=FsaeR8fKwT&rank=3", "https://www.goodreads.com/book/show/43615.The_Gunslinger?from_search=true&from_srp=true&qid=FsaeR8fKwT&rank=4", "https://www.goodreads.com/book/show/10614.Misery?from_search=true&from_srp=true&qid=FsaeR8fKwT&rank=5", "https://www.goodreads.com/book/show/10592.Carrie?from_search=true&from_srp=true&qid=FsaeR8fKwT&rank=6", "https://www.goodreads.com/book/show/10644930-11-22-63?from_search=true&from_srp=true&qid=FsaeR8fKwT&rank=7", "https://www.goodreads.com/book/show/10612.The_Stephen_King_Universe?from_search=true&from_srp=true&qid=FsaeR8fKwT&rank=8", "https://www.goodreads.com/book/show/36124936-the-outsider?from_search=true&from_srp=true&qid=FsaeR8fKwT&rank=9", "https://www.goodreads.com/book/show/11590._Salem_s_Lot?from_search=true&from_srp=true&qid=FsaeR8fKwT&rank=10", "https://www.goodreads.com/book/show/10569.On_Writing?from_search=true&from_srp=true&qid=FsaeR8fKwT&rank=11", "https://www.goodreads.com/book/show/11566.The_Green_Mile?from_search=true&from_srp=true&qid=FsaeR8fKwT&rank=12", "https://www.goodreads.com/book/show/6320534-under-the-dome?from_search=true&from_srp=true&qid=FsaeR8fKwT&rank=13", "https://www.goodreads.com/book/show/18775247-mr-mercedes?from_search=true&from_srp=true&qid=FsaeR8fKwT&rank=14", "https://www.goodreads.com/book/show/16130549-doctor-sleep?from_search=true&from_srp=true&qid=FsaeR8fKwT&rank=15", "https://www.goodreads.com/book/show/33124137-pet-sematary?from_search=true&from_srp=true&qid=FsaeR8fKwT&rank=16", "https://www.goodreads.com/book/show/10603.Cujo?from_search=true&from_srp=true&qid=FsaeR8fKwT&rank=17", "https://www.goodreads.com/book/show/43798285-the-institute?from_search=true&from_srp=true&qid=FsaeR8fKwT&rank=18", "https://www.goodreads.com/book/show/5094.The_Drawing_of_the_Three?from_search=true&from_srp=true&qid=FsaeR8fKwT&rank=19", "https://www.goodreads.com/book/show/107291.Needful_Things?from_search=true&from_srp=true&qid=FsaeR8fKwT&rank=20"], "unique ID": ["11588", "830502", "149267", "43615", "10614", "10592", "10644930", "10612", "36124936", "11590", "10569", "11566", "6320534", "18775247", "16130549", "33124137", "10603", "43798285", "5094", "107291"], "book title": ["The Shining", "It", "The Stand", "The Gunslinger", "Misery", "Carrie", "11/22/63", "The Stephen King Universe: A Guide to the Worlds of the King of Horror", "The Outsider", "'Salem's Lot", "On Writing: A Memoir of the Craft", "The Green Mile", "Under the Dome", "Mr. Mercedes", "Doctor Sleep", "Pet Sematary", "Cujo", "The Institute", "The Drawing of the Three", "Needful Things"], "author name": ["by Stephen King (Goodreads Author)", "by Stephen King (Goodreads Author)", "by Stephen King (Goodreads Author), Bernie Wrightson (Illustrator)", "by Stephen King (Goodreads Author)", "by Stephen King (Goodreads Author)", "by Stephen King (Goodreads Author), Sissy Spacek (Translation)", "by Stephen King (Goodreads Author)", "by Stanley Wiater, Christopher Golden (Goodreads Author), Hank Wagner", "by Stephen King (Goodreads Author)", "by Stephen King (Goodreads Author)", "by Stephen King (Goodreads Author)", "by Stephen King (Goodreads Author)", "by Stephen King (Goodreads Author)", "by Stephen King (Goodreads Author)", "by Stephen King (Goodreads Author)", "by Stephen King (Goodreads Author)", "by Stephen King (Goodreads Author)", "by Stephen King (Goodreads Author)", "by Stephen King (Goodreads Author)", "by Stephen King (Goodreads Author)"], "rating": ["4.25", "4.25", "4.34", "3.94", "4.19", "3.98", "4.31", "4.16", "3.99", "4.04", "4.32", "4.46", "3.91", "3.98", "4.12", "4.03", "3.75", "4.20", "4.22", "3.94"], "book description": ["Jack Torrance's new job at the Overlook Hotel is the perfect chance for a fresh start. As the off-season caretaker at the atmospheric old hotel, he'll have plenty of time to spend reconnecting with his family and working on his writing. But as the harsh winter weather sets in, the idyllic location feels ever more remote...and more sinister. And the only one to notice the s ...more", "Welcome to Derry, Maine ...\n\nIt’s a small city, a place as hauntingly familiar as your own hometown. Only in Derry the haunting is real ...\n\nThey were seven teenagers when they first stumbled upon the horror. Now they are grown-up men and women who have gone out into the big world to gain success and happiness. But none of them can withstand the force that has drawn them back\n\n\n\n...more", "When a man escapes from a biological testing facility, he sets in motion a deadly domino effect, spreading a mutated strain of the flu that will wipe out 99 percent of humanity within a few weeks. The survivors who remain are scared, bewildered, and in need of a leader. Two emerge–Mother Abagail, the benevolent 108-year-old woman who urges them to build a peaceful communit ...more", "In the first book of this brilliant series, Stephen King introduces readers to one of his most enigmatic heroes, Roland of Gilead, The Last Gunslinger. He is a haunting figure, a loner on a spellbinding journey into good and evil. In his desolate world, which frighteningly mirrors our own, Roland pursues The Man in Black, encounters an alluring woman named Alice, and begin ...more", "Alternate cover editions here and here.\n\nPaul Sheldon. He's a bestselling novelist who has finally met his biggest fan. Her name is Annie Wilkes and she is more than a rabid reader - she is Paul's nurse, tending his shattered body after an automobile accident. But she is also his captor, keeping him prisoner in her isolated house.\n\n...more", "A modern classic, Carrie introduced a distinctive new voice in American fiction -- Stephen King. The story of misunderstood high school girl Carrie White, her extraordinary telekinetic powers, and her violent rampage of revenge, remains one of the most barrier-breaking and shocking novels of all time.\n\nMake a date with terror and live the nightmare that is...Carrie\n--back cov\n\n\n...more", "On November 22, 1963, three shots rang out in Dallas, President Kennedy died, and the world changed. What if you could change it back? Stephen King’s heart-stoppingly dramatic new novel is about a man who travels back in time to prevent the JFK assassination—a thousand page tour de force. Following his massively successful novel Under the Dome, King sweeps readers back in\n\n\n\n...more", "\"I am coming to understand that Roland's world actually contains all the others of my making\" \u0097Stephen King\nWith those words, from The Dark Tower: IV Wizard and Glass, the world's most popular writer confirmed a suspicion long held by readers\u0097that the myriad worlds and universes King has created are, in reality, one world, one universe.\nHere, for the first time ever is the g\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n...more", "An unspeakable crime. A confounding investigation. At a time when the King brand has never been stronger, he has delivered one of his most unsettling and compulsively readable stories.\n\nAn eleven-year-old boy’s violated corpse is found in a town park. Eyewitnesses and fingerprints point unmistakably to one of Flint City’s most popular citizens. He is Terry Maitland, Little L\n\n\n\n...more", "Thousands of miles away from the small township of 'Salem's Lot, two terrified people, a man and a boy, still share the secrets of those clapboard houses and tree-lined streets. They must return to 'Salem's Lot for a final confrontation with the unspeakable evil that lives on in the town. ...more", "\"Long live the King\" hailed Entertainment Weekly upon the publication of Stephen King's On Writing. Part memoir, part master class by one of the bestselling authors of all time, this superb volume is a revealing and practical view of the writer's craft, comprising the basic tools of the trade every writer must have. King's advice is grounded in his vivid memories from chil\n...more", "When it first appeared, one volume per month, Stephen King's THE GREEN MILE was an unprecedented publishing triumph: all six volumes ended up on the New York Times bestseller lists—simultaneously—and delighted millions of fans the world over.\n\nWelcome to Cold Mountain Penitentiary, home to the Depression-worn men of E Block. Convicted killers all, each awaits his turn to wal\n\n...more", "On an entirely normal, beautiful fall day in Chester’s Mill, Maine, the town is inexplicably and suddenly sealed off from the rest of the world by an invisible force field. Planes crash into it and fall from the sky in flaming wreckage, a gardener’s hand is severed as “the dome” comes down on it, people running errands in the neighboring town are divided from their familie\n\n\n...more", "In the predawn hours, in a distressed American city, hundreds of unemployed men and women line up for the opening of a job fair. They are tired and cold and desperate. Emerging from the fog, invisible until it is too late, a lone driver plows through the crowd in a stolen Mercedes, running over the innocent, backing up, and charging again. Eight people are killed; fifteen\n\n\n\n\n\n\n...more", "Stephen King returns to the characters and territory of one of his most popular novels ever, The Shining, in this instantly riveting novel about the now middle-aged Dan Torrance (the boy protagonist of The Shining) and the very special 12-year-old girl he must save from a tribe of murderous paranormals.\n\nOn highways across America, a tribe of people called The True Knot trav\n\n\n\n\n\n...more", "'This is an alternate Cover Edition for ASIN: B00K3NEE56. When the Creeds move into a beautiful old house in rural Maine, it all seems too good to be true: physician father, beautiful wife, charming little daughter, adorable infant son-and now an idyllic home. As a family, they've got it all...right down to the friendly car. But the nearby woods hide a blood-chilling truth ...more", "Durante toda su vida Cujo fue un buen perro, un San Bernardo grandote, pacífico, juguetón y amante de los niños. Realmente se trataba de un perro bueno y feliz. Feliz hasta que le sucedió algo, y el cerebro de perro de Cujo se cubrió de una de esas oscuridades que se alimentan de sangre. Ahora, se ha convertido en un perro asesino; doblemente cruel por cuanto la gente no c\n\n...more", "In the middle of the night, in a house on a quiet street in suburban Minneapolis, intruders silently murder Luke Ellis’s parents and load him into a black SUV. The operation takes less than two minutes. Luke will wake up at The Institute, in a room that looks just like his own, except there’s no window. And outside his door are other doors, behind which are other kids with\n\n...more", "While pursuing his quest for the Dark Tower through a world that is a nightmarishly distorted mirror image of our own, Roland, the last gunslinger, encounters three mysterious doorways on the beach. Each one enters into the life of a different person living in contemporary New York.\n\nHere he links forces with the defiant young Eddie Dean and the beautiful, brilliant, and br\n\n\n\n...more", "Leland Gaunt opens a new shop in Castle Rock called Needful Things. Anyone who enters his store finds the object of his or her lifelong dreams and desires: a prized baseball card, a healing amulet. In addition to a token payment, Gaunt requests that each person perform a little \"deed,\" usually a seemingly innocent prank played on someone else from town. These practical jok ...more"], "book cover links": ["https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1353277730l/11588.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1334416842l/830502.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1213131305l/149267.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1554220416l/43615.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1554220401l/10614.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1166254258l/10592._SY475_.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1327876792l/10644930.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1429751532l/10612.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1524596540l/36124936._SY475_.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1327891565l/11590.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1436735207l/10569._SY475_.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1373903563l/11566.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1511289992l/6320534._SY475_.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1468705326l/18775247._SY475_.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1510335480l/16130549._SY475_.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1480069533l/33124137._SY475_.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1394208144l/10603.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1549241208l/43798285.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1370918050l/5094.jpg", "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1315767817l/107291.jpg"], "v4 UUID": ["340d4846-783b-4c83-aa06-10900a70d7ff", "593e76a8-64f9-4cab-8971-15ab183bc8bc", "2f369226-a25c-4a08-b97e-c6754b9f239c", "81c7eef8-94b0-475a-b7e8-430016b5430b", "54841797-27ba-4306-bf23-365f413359cf", "86984340-81fc-48cb-a62f-194c382039d8", "0fa748b7-890e-49a7-a829-6b7c176dcebb", "ace7023d-cb74-4f63-a552-58da05ed4d38", "a47c68a4-76a4-4c3b-8cdc-a4edaa8e4618", "917e218b-e551-4f3d-a46c-31c51609e319", "e3e14823-2b52-4fdb-a67e-a2ccb573a905", "1f577a26-1b82-42aa-9d98-8075dd473660", "b32a2e8d-ba53-4a9c-9a93-af1defc20cbd", "4a0ccd12-322a-4cfa-b4ff-3cd504fdd5aa", "bdf9b821-61b2-40ca-ba8d-53b1c3a846f9", "400e73be-e9b6-4bda-9596-a93097107e75", "f44a685b-d05d-4c80-9170-aafd22e9db26", "f9a01955-96f0-479e-a7cc-e07bede92894", "a3f93c3d-49aa-4760-b820-83a1382e834e", "258602d4-7e4b-41a4-bde8-a9656f92238e"]}